analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/max32665.h
#define MXC_BASE_GPIO0 ((uint32_t)0x40008000UL)
#define MXC_GPIO0 ((mxc_gpio_regs_t *)MXC_BASE_GPIO0)
#define MXC_BASE_GPIO1 ((uint32_t)0x40009000UL)
#define MXC_GPIO1 ((mxc_gpio_regs_t *)MXC_BASE_GPIO1)

#define MXC_GPIO_GET_IDX(p) ((p) == MXC_GPIO0 ? 0 : (p) == MXC_GPIO1 ? 1 : -1)

#define MXC_GPIO_GET_GPIO(i) ((i) == 0 ? MXC_GPIO0 : (i) == 1 ? MXC_GPIO1 : 0)

#define MXC_GPIO_GET_IRQ(i) ((i) == 0 ? GPIO0_IRQn : (i) == 1 ? GPIO1_IRQn : (IRQn_Type)0)

/******************************************************************************/
/*                                                                      Timer */
#define MXC_CFG_TMR_INSTANCES (6)

#define MXC_BASE_TMR0 ((uint32_t)0x40010000UL)
#define MXC_TMR0 ((mxc_tmr_regs_t *)MXC_BASE_TMR0)
#define MXC_BASE_TMR1 ((uint32_t)0x40011000UL)
#define MXC_TMR1 ((mxc_tmr_regs_t *)MXC_BASE_TMR1)
#define MXC_BASE_TMR2 ((uint32_t)0x40012000UL)
#define MXC_TMR2 ((mxc_tmr_regs_t *)MXC_BASE_TMR2)
#define MXC_BASE_TMR3 ((uint32_t)0x40013000UL)
#define MXC_TMR3 ((mxc_tmr_regs_t *)MXC_BASE_TMR3)
#define MXC_BASE_TMR4 ((uint32_t)0x40014000UL)
#define MXC_TMR4 ((mxc_tmr_regs_t *)MXC_BASE_TMR4)
#define MXC_BASE_TMR5 ((uint32_t)0x40015000UL)
#define MXC_TMR5 ((mxc_tmr_regs_t *)MXC_BASE_TMR5)

#define MXC_TMR_GET_IRQ(i)             \
    (IRQn_Type)((i) == 0 ? TMR0_IRQn : \
                (i) == 1 ? TMR1_IRQn : \
                (i) == 2 ? TMR2_IRQn : \
                (i) == 3 ? TMR3_IRQn : \
                (i) == 4 ? TMR4_IRQn : \
                (i) == 5 ? TMR5_IRQn : \
                           0)

#define MXC_TMR_GET_BASE(i)     \
    ((i) == 0 ? MXC_BASE_TMR0 : \
     (i) == 1 ? MXC_BASE_TMR1 : \
     (i) == 2 ? MXC_BASE_TMR2 : \
     (i) == 3 ? MXC_BASE_TMR3 : \
     (i) == 4 ? MXC_BASE_TMR4 : \
     (i) == 5 ? MXC_BASE_TMR5 : \
                0)

#define MXC_TMR_GET_TMR(i) \
    ((i) == 0 ? MXC_TMR0 : \
     (i) == 1 ? MXC_TMR1 : \
     (i) == 2 ? MXC_TMR2 : \
     (i) == 3 ? MXC_TMR3 : \
     (i) == 4 ? MXC_TMR4 : \
     (i) == 5 ? MXC_TMR5 : \
                0)

#define MXC_TMR_GET_IDX(p) \
    ((p) == MXC_TMR0 ? 0 : \
     (p) == MXC_TMR1 ? 1 : \
     (p) == MXC_TMR2 ? 2 : \
     (p) == MXC_TMR3 ? 3 : \
     (p) == MXC_TMR4 ? 4 : \
     (p) == MXC_TMR5 ? 5 : \
                       -1)

/******************************************************************************/
/*                                                           High Speed Timer */
#define MXC_BASE_HTMR0 ((uint32_t)0x4001B000UL)
#define MXC_HTMR0 ((mxc_htmr_regs_t *)MXC_BASE_HTMR0)
#define MXC_BASE_HTMR1 ((uint32_t)0x4001C000UL)
#define MXC_HTMR1 ((mxc_htmr_regs_t *)MXC_BASE_HTMR1)

/******************************************************************************/
/*                                                                        I2C */
#define MXC_I2C_INSTANCES (3)

#define MXC_BASE_I2C0_BUS0 ((uint32_t)0x4001D000UL)
#define MXC_I2C0_BUS0 ((mxc_i2c_regs_t *)MXC_BASE_I2C0_BUS0)
#define MXC_BASE_I2C1_BUS0 ((uint32_t)0x4001E000UL)
#define MXC_I2C1_BUS0 ((mxc_i2c_regs_t *)MXC_BASE_I2C1_BUS0)
#define MXC_BASE_I2C2_BUS0 ((uint32_t)0x4001F000UL)
#define MXC_I2C2_BUS0 ((mxc_i2c_regs_t *)MXC_BASE_I2C2_BUS0)

#define MXC_BASE_I2C0_BUS1 ((uint32_t)0x4011D000UL)
#define MXC_I2C0_BUS1 ((mxc_i2c_regs_t *)MXC_BASE_I2C0_BUS1)
#define MXC_BASE_I2C1_BUS1 ((uint32_t)0x4011E000UL)
#define MXC_I2C1_BUS1 ((mxc_i2c_regs_t *)MXC_BASE_I2C1_BUS1)
#define MXC_BASE_I2C2_BUS1 ((uint32_t)0x4011F000UL)
#define MXC_I2C2_BUS1 ((mxc_i2c_regs_t *)MXC_BASE_I2C2_BUS1)

#define MXC_I2C_GET_IRQ(i)                  \
    (IRQn_Type)((i) == 0x0    ? I2C0_IRQn : \
                (i) == 0x1    ? I2C1_IRQn : \
                (i) == 0x2    ? I2C2_IRQn : \
                (i) == 0x8000 ? I2C0_IRQn : \
                (i) == 0x8001 ? I2C1_IRQn : \
                (i) == 0x8002 ? I2C2_IRQn : \
                                0)

#define MXC_I2C_GET_BASE(i)               \
    ((i) == 0x0    ? MXC_BASE_I2C0_BUS0 : \
     (i) == 0x1    ? MXC_BASE_I2C1_BUS0 : \
     (i) == 0x2    ? MXC_BASE_I2C2_BUS0 : \
     (i) == 0x8000 ? MXC_BASE_I2C0_BUS1 : \
     (i) == 0x8001 ? MXC_BASE_I2C1_BUS1 : \
     (i) == 0x8002 ? MXC_BASE_I2C2_BUS1 : \
                     0)

#define MXC_I2C_GET_IDX(p)           \
    ((p) == MXC_I2C0_BUS0 ? 0x0 :    \
     (p) == MXC_I2C1_BUS0 ? 0x1 :    \
     (p) == MXC_I2C2_BUS0 ? 0x2 :    \
     (p) == MXC_I2C0_BUS1 ? 0x8000 : \
     (p) == MXC_I2C1_BUS1 ? 0x8001 : \
     (p) == MXC_I2C2_BUS1 ? 0x8002 : \
                            -1)

#define MXC_I2C_GET_I2C(p)           \
    ((p) == 0x0    ? MXC_I2C0_BUS0 : \
     (p) == 0x1    ? MXC_I2C1_BUS0 : \
     (p) == 0x2    ? MXC_I2C2_BUS0 : \
     (p) == 0x8000 ? MXC_I2C0_BUS1 : \
     (p) == 0x8001 ? MXC_I2C1_BUS1 : \
     (p) == 0x8002 ? MXC_I2C2_BUS1 : \
                     0)
#define MXC_I2C_FIFO_DEPTH (8)

/******************************************************************************/
/*                                                      SPI Execute in Place  */
#define MXC_BASE_SPIXFM ((uint32_t)0x40026000UL)
#define MXC_SPIXFM ((mxc_spixfm_regs_t *)MXC_BASE_SPIXFM)

#define MXC_BASE_SPIXFC_FIFO ((uint32_t)0x400BC000UL)
#define MXC_SPIXFC_FIFO ((mxc_spixfc_fifo_regs_t *)MXC_BASE_SPIXFC_FIFO)
/******************************************************************************/
/*                                                SPI Execute in Place Master */

#define MXC_CFG_SPIXFC_FIFO_DEPTH (16)

#define MXC_BASE_SPIXFC ((uint32_t)0x40027000UL)
#define MXC_SPIXFC ((mxc_spixfc_regs_t *)MXC_BASE_SPIXFC)

/******************************************************************************/
/*                                                                        DMA */
#define MXC_DMA_CHANNELS (16)
#define MXC_DMA_INSTANCES (2)
#define MXC_DMA_CH_OFFSET (8)

#define MXC_BASE_DMA0 ((uint32_t)0x40028000UL)
#define MXC_DMA0 ((mxc_dma_regs_t *)MXC_BASE_DMA0)
#define MXC_BASE_DMA1 ((uint32_t)0x40035000UL)
#define MXC_DMA1 ((mxc_dma_regs_t *)MXC_BASE_DMA1)

#define MXC_DMA_GET_BASE(i) ((i) == 0 ? MXC_BASE_DMA0 : (i) == 1 ? MXC_BASE_DMA1 : 0)

