analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/max32665.h
#define MXC_DMA_GET_DMA(i) ((i) == 0 ? MXC_DMA0 : (i) == 1 ? MXC_DMA1 : 0)

#define MXC_DMA_GET_IDX(p) ((p) == MXC_DMA0 ? 0 : (p) == MXC_DMA1 ? 1 : -1)

#define MXC_DMA0_CH_GET_IRQ(i) ((IRQn_Type)(((i) == 0) ? DMA0_IRQn : ((i) == 1) ? DMA1_IRQn : \
                                ((i) == 2) ? DMA2_IRQn : ((i) == 3) ? DMA3_IRQn : \
                                ((i) == 4) ? DMA4_IRQn : ((i) == 5) ? DMA5_IRQn : \
                                ((i) == 6) ? DMA6_IRQn : ((i) == 7) ? DMA7_IRQn : 0))

#define MXC_DMA1_CH_GET_IRQ(i) ((IRQn_Type)(((i) == 0) ? DMA8_IRQn : ((i) == 1) ? DMA9_IRQn : \
                                ((i) == 2) ? DMA10_IRQn : ((i) == 3) ? DMA11_IRQn : \
                                ((i) == 4) ? DMA12_IRQn : ((i) == 5) ? DMA13_IRQn : \
                                ((i) == 6) ? DMA14_IRQn : ((i) == 7) ? DMA15_IRQn : 0))

/* Create alias for MXC_DMA0 for backwards compatibility with code that was
   written for parts that only had one DMA instance. */
#define MXC_DMA MXC_DMA0

/******************************************************************************/
/*                                                                        FLC */
#define MXC_FLC_INSTANCES (2)

#define MXC_BASE_FLC0 ((uint32_t)0x40029000UL)
#define MXC_FLC0 ((mxc_flc_regs_t *)MXC_BASE_FLC0)
#define MXC_BASE_FLC1 ((uint32_t)0x40029400UL)
#define MXC_FLC1 ((mxc_flc_regs_t *)MXC_BASE_FLC1)

#define MXC_FLC_GET_IRQ(i) (IRQn_Type)((i) == 0 ? FLC0_IRQn : (i) == 1 ? FLC1_IRQn : 0)

#define MXC_FLC_GET_BASE(i) ((i) == 0 ? MXC_BASE_FLC0 : (i) == 1 ? MXC_BASE_FLC1 : 0)

#define MXC_FLC_GET_FLC(i) ((i) == 0 ? MXC_FLC0 : (i) == 1 ? MXC_FLC1 : 0)

#define MXC_FLC_GET_IDX(p) ((p) == MXC_FLC0 ? 0 : (p) == MXC_FLC1 ? 1 : -1)

/******************************************************************************/
/*                                                          Instruction Cache */
#define MXC_ICC_INSTANCES (2)

#define MXC_BASE_ICC0 ((uint32_t)0x4002A000UL)
#define MXC_ICC0 ((mxc_icc_regs_t *)MXC_BASE_ICC0)
#define MXC_BASE_ICC1 ((uint32_t)0x4002A800UL)
#define MXC_ICC1 ((mxc_icc_regs_t *)MXC_BASE_ICC1)

#define MXC_ICC MXC_ICC0

#define MXC_ICC_GET_BASE(i) ((i) == 0 ? MXC_BASE_ICC0 : (i) == 1 ? MXC_BASE_ICC1 : 0)

#define MXC_ICC_GET_ICC(i) ((i) == 0 ? MXC_ICC0 : (i) == 1 ? MXC_ICC1 : 0)

#define MXC_ICC_GET_IDX(p) ((p) == MXC_ICC0 ? 0 : (p) == MXC_ICC1 ? 1 : -1)

/******************************************************************************/
/*                                                      Instruction Cache XIP */
#define MXC_BASE_SFCC ((uint32_t)0x4002F000UL)
#define MXC_SFCC ((mxc_icc_regs_t *)MXC_BASE_SFCC)

/******************************************************************************/
/*                                                                 Data Cache */
#define MXC_BASE_SRCC ((uint32_t)0x40033000UL)
#define MXC_SRCC ((mxc_srcc_regs_t *)MXC_BASE_SRCC)

/******************************************************************************/
/*                                                                        ADC */
#define MXC_BASE_ADC ((uint32_t)0x40034000UL)
#define MXC_ADC ((mxc_adc_regs_t *)MXC_BASE_ADC)
#define MXC_ADC_MAX_CLOCK 8000000 // Maximum ADC clock in Hz

/******************************************************************************/
/*                                                                  Smart DMA */
#define MXC_BASE_SDMA ((uint32_t)0x40036000UL)
#define MXC_SDMA ((mxc_sdma_regs_t *)MXC_BASE_SDMA)

/******************************************************************************/
/*                                                               SPI XIP Data */
#define MXC_BASE_SPIXR ((uint32_t)0x4003A000UL)
#define MXC_SPIXR ((mxc_spixr_regs_t *)MXC_BASE_SPIXR)

/*******************************************************************************/
/*                                                      Pulse Train Generation */
#define MXC_CFG_PT_INSTANCES (16)

#define MXC_BASE_PTG_BUS0 ((uint32_t)0x4003C000UL)
#define MXC_PTG_BUS0 ((mxc_ptg_regs_t *)MXC_BASE_PTG_BUS0)
#define MXC_BASE_PT0_BUS0 ((uint32_t)0x4003C020UL)
#define MXC_PT0_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT0_BUS0)
#define MXC_BASE_PT1_BUS0 ((uint32_t)0x4003C040UL)
#define MXC_PT1_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT1_BUS0)
#define MXC_BASE_PT2_BUS0 ((uint32_t)0x4003C060UL)
#define MXC_PT2_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT2_BUS0)
#define MXC_BASE_PT3_BUS0 ((uint32_t)0x4003C080UL)
#define MXC_PT3_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT3_BUS0)
#define MXC_BASE_PT4_BUS0 ((uint32_t)0x4003C0A0UL)
#define MXC_PT4_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT4_BUS0)
#define MXC_BASE_PT5_BUS0 ((uint32_t)0x4003C0C0UL)
#define MXC_PT5_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT5_BUS0)
#define MXC_BASE_PT6_BUS0 ((uint32_t)0x4003C0E0UL)
#define MXC_PT6_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT6_BUS0)
#define MXC_BASE_PT7_BUS0 ((uint32_t)0x4003C100UL)
#define MXC_PT7_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT7_BUS0)
#define MXC_BASE_PT8_BUS0 ((uint32_t)0x4003C120UL)
#define MXC_PT8_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT8_BUS0)
#define MXC_BASE_PT9_BUS0 ((uint32_t)0x4003C140UL)
#define MXC_PT9_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT9_BUS0)
#define MXC_BASE_PT10_BUS0 ((uint32_t)0x4003C160UL)
#define MXC_PT10_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT10_BUS0)
#define MXC_BASE_PT11_BUS0 ((uint32_t)0x4003C180UL)
#define MXC_PT11_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT11_BUS0)
#define MXC_BASE_PT12_BUS0 ((uint32_t)0x4003C1A0UL)
#define MXC_PT12_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT12_BUS0)
#define MXC_BASE_PT13_BUS0 ((uint32_t)0x4003C1C0UL)
#define MXC_PT13_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT13_BUS0)
#define MXC_BASE_PT14_BUS0 ((uint32_t)0x4003C1E0UL)
#define MXC_PT14_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT14_BUS0)
#define MXC_BASE_PT15_BUS0 ((uint32_t)0x4003C200UL)
#define MXC_PT15_BUS0 ((mxc_pt_regs_t *)MXC_BASE_PT15_BUS0)

#define MXC_BASE_PTG_BUS1 ((uint32_t)0x4013C000UL)
#define MXC_PTG_BUS1 ((mxc_ptg_regs_t *)MXC_BASE_PTG_BUS1)
#define MXC_BASE_PT0_BUS1 ((uint32_t)0x4013C020UL)
#define MXC_PT0_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT0_BUS1)
#define MXC_BASE_PT1_BUS1 ((uint32_t)0x4013C040UL)
#define MXC_PT1_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT1_BUS1)
#define MXC_BASE_PT2_BUS1 ((uint32_t)0x4013C060UL)
#define MXC_PT2_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT2_BUS1)
#define MXC_BASE_PT3_BUS1 ((uint32_t)0x4013C080UL)
#define MXC_PT3_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT3_BUS1)
#define MXC_BASE_PT4_BUS1 ((uint32_t)0x4013C0A0UL)
#define MXC_PT4_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT4_BUS1)
#define MXC_BASE_PT5_BUS1 ((uint32_t)0x4013C0C0UL)
#define MXC_PT5_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT5_BUS1)
#define MXC_BASE_PT6_BUS1 ((uint32_t)0x4013C0E0UL)
#define MXC_PT6_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT6_BUS1)
#define MXC_BASE_PT7_BUS1 ((uint32_t)0x4013C100UL)
#define MXC_PT7_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT7_BUS1)
#define MXC_BASE_PT8_BUS1 ((uint32_t)0x4013C120UL)
#define MXC_PT8_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT8_BUS1)
#define MXC_BASE_PT9_BUS1 ((uint32_t)0x4013C140UL)
#define MXC_PT9_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT9_BUS1)
#define MXC_BASE_PT10_BUS1 ((uint32_t)0x4013C160UL)
#define MXC_PT10_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT10_BUS1)
#define MXC_BASE_PT11_BUS1 ((uint32_t)0x4013C180UL)
#define MXC_PT11_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT11_BUS1)
#define MXC_BASE_PT12_BUS1 ((uint32_t)0x4013C1A0UL)
#define MXC_PT12_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT12_BUS1)
#define MXC_BASE_PT13_BUS1 ((uint32_t)0x4013C1C0UL)
#define MXC_PT13_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT13_BUS1)
#define MXC_BASE_PT14_BUS1 ((uint32_t)0x4013C1E0UL)
#define MXC_PT14_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT14_BUS1)
#define MXC_BASE_PT15_BUS1 ((uint32_t)0x4013C200UL)
#define MXC_PT15_BUS1 ((mxc_pt_regs_t *)MXC_BASE_PT15_BUS1)

#define MXC_PT_GET_BASE(i)                \
    ((i) == 0x0    ? MXC_BASE_PT0_BUS0 :  \
     (i) == 0x1    ? MXC_BASE_PT1_BUS0 :  \
     (i) == 0x2    ? MXC_BASE_PT2_BUS0 :  \
     (i) == 0x3    ? MXC_BASE_PT3_BUS0 :  \
     (i) == 0x4    ? MXC_BASE_PT4_BUS0 :  \
     (i) == 0x5    ? MXC_BASE_PT5_BUS0 :  \
     (i) == 0x6    ? MXC_BASE_PT6_BUS0 :  \
     (i) == 0x7    ? MXC_BASE_PT7_BUS0 :  \
     (i) == 0x8    ? MXC_BASE_PT8_BUS0 :  \
     (i) == 0x9    ? MXC_BASE_PT9_BUS0 :  \
     (i) == 0xA    ? MXC_BASE_PT10_BUS0 : \
     (i) == 0xB    ? MXC_BASE_PT11_BUS0 : \
     (i) == 0xC    ? MXC_BASE_PT12_BUS0 : \
     (i) == 0xD    ? MXC_BASE_PT13_BUS0 : \
     (i) == 0xE    ? MXC_BASE_PT14_BUS0 : \
     (i) == 0xF    ? MXC_BASE_PT15_BUS0 : \
     (i) == 0x8000 ? MXC_BASE_PT0_BUS1 :  \
     (i) == 0x8001 ? MXC_BASE_PT1_BUS1 :  \
     (i) == 0x8002 ? MXC_BASE_PT2_BUS1 :  \
     (i) == 0x8003 ? MXC_BASE_PT3_BUS1 :  \
     (i) == 0x8004 ? MXC_BASE_PT4_BUS1 :  \
     (i) == 0x8005 ? MXC_BASE_PT5_BUS1 :  \
     (i) == 0x8006 ? MXC_BASE_PT6_BUS1 :  \
     (i) == 0x8007 ? MXC_BASE_PT7_BUS1 :  \
     (i) == 0x8008 ? MXC_BASE_PT8_BUS1 :  \
     (i) == 0x8009 ? MXC_BASE_PT9_BUS1 :  \
     (i) == 0x800A ? MXC_BASE_PT10_BUS1 : \
     (i) == 0x800B ? MXC_BASE_PT11_BUS1 : \
     (i) == 0x800C ? MXC_BASE_PT12_BUS1 : \
     (i) == 0x800D ? MXC_BASE_PT13_BUS1 : \
     (i) == 0x800E ? MXC_BASE_PT14_BUS1 : \
     (i) == 0x800F ? MXC_BASE_PT15_BUS1 : \
                     0)

#define MXC_PT_GET_PT(i)             \
    ((i) == 0x0    ? MXC_PT0_BUS0 :  \
     (i) == 0x1    ? MXC_PT1_BUS0 :  \
     (i) == 0x2    ? MXC_PT2_BUS0 :  \
     (i) == 0x3    ? MXC_PT3_BUS0 :  \
     (i) == 0x4    ? MXC_PT4_BUS0 :  \
     (i) == 0x5    ? MXC_PT5_BUS0 :  \
     (i) == 0x6    ? MXC_PT6_BUS0 :  \
     (i) == 0x7    ? MXC_PT7_BUS0 :  \
     (i) == 0x8    ? MXC_PT8_BUS0 :  \
     (i) == 0x9    ? MXC_PT9_BUS0 :  \
     (i) == 0xA    ? MXC_PT10_BUS0 : \
     (i) == 0xB    ? MXC_PT11_BUS0 : \
     (i) == 0xC    ? MXC_PT12_BUS0 : \
     (i) == 0xD    ? MXC_PT13_BUS0 : \
     (i) == 0xE    ? MXC_PT14_BUS0 : \
     (i) == 0xF    ? MXC_PT15_BUS0 : \
     (i) == 0x8000 ? MXC_PT0_BUS1 :  \
     (i) == 0x8001 ? MXC_PT1_BUS1 :  \
     (i) == 0x8002 ? MXC_PT2_BUS1 :  \
     (i) == 0x8003 ? MXC_PT3_BUS1 :  \
     (i) == 0x8004 ? MXC_PT4_BUS1 :  \
     (i) == 0x8005 ? MXC_PT5_BUS1 :  \
     (i) == 0x8006 ? MXC_PT6_BUS1 :  \
     (i) == 0x8007 ? MXC_PT7_BUS1 :  \
     (i) == 0x8008 ? MXC_PT8_BUS1 :  \
     (i) == 0x8009 ? MXC_PT9_BUS1 :  \
     (i) == 0x800A ? MXC_PT10_BUS1 : \
     (i) == 0x800B ? MXC_PT11_BUS1 : \
     (i) == 0x800C ? MXC_PT12_BUS1 : \
     (i) == 0x800D ? MXC_PT13_BUS1 : \
     (i) == 0x800E ? MXC_PT14_BUS1 : \
     (i) == 0x800F ? MXC_PT15_BUS1 : \
                     0)

