analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/max32665.h
#define MXC_PT_GET_IDX(p)            \
    ((p) == MXC_PT0_BUS0  ? 0x0 :    \
     (p) == MXC_PT1_BUS0  ? 0x1 :    \
     (p) == MXC_PT2_BUS0  ? 0x2 :    \
     (p) == MXC_PT3_BUS0  ? 0x3 :    \
     (p) == MXC_PT4_BUS0  ? 0x4 :    \
     (p) == MXC_PT5_BUS0  ? 0x5 :    \
     (p) == MXC_PT6_BUS0  ? 0x6 :    \
     (p) == MXC_PT7_BUS0  ? 0x7 :    \
     (p) == MXC_PT8_BUS0  ? 0x8 :    \
     (p) == MXC_PT9_BUS0  ? 0x9 :    \
     (p) == MXC_PT10_BUS0 ? 0xA :    \
     (p) == MXC_PT11_BUS0 ? 0xB :    \
     (p) == MXC_PT12_BUS0 ? 0xC :    \
     (p) == MXC_PT13_BUS0 ? 0xD :    \
     (p) == MXC_PT14_BUS0 ? 0xE :    \
     (p) == MXC_PT15_BUS0 ? 0xF :    \
     (p) == MXC_PT0_BUS1  ? 0x8000 : \
     (p) == MXC_PT1_BUS1  ? 0x8001 : \
     (p) == MXC_PT2_BUS1  ? 0x8002 : \
     (p) == MXC_PT3_BUS1  ? 0x8003 : \
     (p) == MXC_PT4_BUS1  ? 0x8004 : \
     (p) == MXC_PT5_BUS1  ? 0x8005 : \
     (p) == MXC_PT6_BUS1  ? 0x8006 : \
     (p) == MXC_PT7_BUS1  ? 0x8007 : \
     (p) == MXC_PT8_BUS1  ? 0x8008 : \
     (p) == MXC_PT9_BUS1  ? 0x8009 : \
     (p) == MXC_PT10_BUS1 ? 0x800A : \
     (p) == MXC_PT11_BUS1 ? 0x800B : \
     (p) == MXC_PT12_BUS1 ? 0x800C : \
     (p) == MXC_PT13_BUS1 ? 0x800D : \
     (p) == MXC_PT14_BUS1 ? 0x800E : \
     (p) == MXC_PT15_BUS1 ? 0x800F : \
                            -1)

#define MXC_PT_GET_BUS(i) (((i)&0x00100000UL) >> 20)

#define MXC_PTG_GET_PTG(i) \
    (MXC_PT_GET_BUS((i)) == 0 ? MXC_PTG_BUS0 : MXC_PT_GET_BUS((i)) == 1 ? MXC_PTG_BUS1 : 0)

/******************************************************************************/
/*                                                            One Wire Master */
#define MXC_BASE_OWM ((uint32_t)0x4003D000UL)
#define MXC_OWM ((mxc_owm_regs_t *)MXC_BASE_OWM)

/******************************************************************************/
/*                                                                  Semaphore */
#define MXC_CFG_SEMA_INSTANCES (8)

#define MXC_BASE_SEMA ((uint32_t)0x4003E000UL)
#define MXC_SEMA ((mxc_sema_regs_t *)MXC_BASE_SEMA)

/******************************************************************************/
/*                                               UART / Serial Port Interface */
#define MXC_UART_INSTANCES (3)
#define MXC_UART_FIFO_DEPTH (32)

#define MXC_BASE_UART0 ((uint32_t)0x40042000UL)
#define MXC_UART0 ((mxc_uart_regs_t *)MXC_BASE_UART0)
#define MXC_BASE_UART1 ((uint32_t)0x40043000UL)
#define MXC_UART1 ((mxc_uart_regs_t *)MXC_BASE_UART1)
#define MXC_BASE_UART2 ((uint32_t)0x40044000UL)
#define MXC_UART2 ((mxc_uart_regs_t *)MXC_BASE_UART2)

#define MXC_UART_GET_IRQ(i)                        \
    (IRQn_Type)((i) == 0            ? UART0_IRQn : \
                (IRQn_Type)(i) == 1 ? UART1_IRQn : \
                (IRQn_Type)(i) == 2 ? UART2_IRQn : \
                                      0)

#define MXC_UART_GET_BASE(i) \
    ((i) == 0 ? MXC_BASE_UART0 : (i) == 1 ? MXC_BASE_UART1 : (i) == 2 ? MXC_BASE_UART2 : 0)

#define MXC_UART_GET_UART(i) \
    ((i) == 0 ? MXC_UART0 : (i) == 1 ? MXC_UART1 : (i) == 2 ? MXC_UART2 : 0)

#define MXC_UART_GET_IDX(p) \
    ((p) == MXC_UART0 ? 0 : (p) == MXC_UART1 ? 1 : (p) == MXC_UART2 ? 2 : -1)

/******************************************************************************/
/*                                                                     SPI */
#define MXC_SPI_INSTANCES (3)
#define MXC_SPI_SS_INSTANCES (4)
#define MXC_SPI_FIFO_DEPTH (32)

#define MXC_BASE_SPI0 ((uint32_t)0x400BE000UL)
#define MXC_SPI0 ((mxc_spi_regs_t *)MXC_BASE_SPI0)
#define MXC_BASE_SPI1 ((uint32_t)0x40046000UL)
#define MXC_SPI1 ((mxc_spi_regs_t *)MXC_BASE_SPI1)
#define MXC_BASE_SPI2 ((uint32_t)0x40047000UL)
#define MXC_SPI2 ((mxc_spi_regs_t *)MXC_BASE_SPI2)

#define MXC_SPI_GET_IDX(p) ((p) == MXC_SPI0 ? 0 : (p) == MXC_SPI1 ? 1 : (p) == MXC_SPI2 ? 2 : -1)

#define MXC_SPI_GET_BASE(i) \
    ((i) == 0 ? MXC_BASE_SPI0 : (i) == 1 ? MXC_BASE_SPI1 : (i) == 2 ? MXC_BASE_SPI2 : 0)

#define MXC_SPI_GET_SPI(i) ((i) == 0 ? MXC_SPI0 : (i) == 1 ? MXC_SPI1 : (i) == 2 ? MXC_SPI2 : 0)

#define MXC_SPI_GET_IRQ(i) \
    (IRQn_Type)((i) == 0 ? SPI0_IRQn : (i) == 1 ? SPI1_IRQn : (i) == 2 ? SPI2_IRQn : 0)

/******************************************************************************/
/*                                                                       TRNG */
#define MXC_BASE_TRNG ((uint32_t)0x4004D000UL)
#define MXC_TRNG ((mxc_trng_regs_t *)MXC_BASE_TRNG)

/******************************************************************************/
/*                                                            Audio Subsystem */
#define MXC_BASE_AUDIO ((uint32_t)0x4004C000UL)
#define MXC_AUDIO ((mxc_audio_regs_t *)MXC_BASE_AUDIO)

/******************************************************************************/
/*                                                       Bluetooth Low Energy */
#define MXC_BASE_BTLE (0x40050000UL)
#define MXC_BTLE ((mxc_btle_regs_t *)MXC_BASE_BTLE)
#define MXC_BASE_BTLE_DBB_CTRL (MXC_BASE_BTLE + 0x1000)
#define MXC_BASE_BTLE_DBB_TX (MXC_BASE_BTLE + 0x2000)
#define MXC_BASE_BTLE_DBB_RX (MXC_BASE_BTLE + 0x3000)
#define MXC_BASE_BTLE_DBB_EXT_RFFE (MXC_BASE_BTLE + 0x8000)

// Base address definitions needed for DBB register definitions in BTLE stack
#define DBB_CTRL_BASE MXC_BASE_BTLE_DBB_CTRL
#define DBB_TX_BASE MXC_BASE_BTLE_DBB_TX
#define DBB_RX_BASE MXC_BASE_BTLE_DBB_RX
#define DBB_EXT_RFFE_BASE MXC_BASE_BTLE_DBB_EXT_RFFE

/******************************************************************************/
/*                                                                        USB */
#define MXC_BASE_USBHS ((uint32_t)0x400B1000UL)
#define MXC_USBHS ((mxc_usbhs_regs_t *)MXC_BASE_USBHS)
#define MXC_USBHS_NUM_EP 12 /* HW must have at least EP 0 CONTROL + 11 IN/OUT */
#define MXC_USBHS_NUM_DMA 8 /* HW must have at least this many DMA channels */
#define MXC_USBHS_MAX_PACKET 512

/******************************************************************************/
/*                                                                       SDHC */
#define MXC_BASE_SDHC ((uint32_t)0x400B6000UL)
#define MXC_SDHC ((mxc_sdhc_regs_t *)MXC_BASE_SDHC)

/******************************************************************************/
/*                                                               Bit Shifting */
#define MXC_F_BIT_0 (1 << 0)
#define MXC_F_BIT_1 (1 << 1)
#define MXC_F_BIT_2 (1 << 2)
#define MXC_F_BIT_3 (1 << 3)
#define MXC_F_BIT_4 (1 << 4)
#define MXC_F_BIT_5 (1 << 5)
#define MXC_F_BIT_6 (1 << 6)
#define MXC_F_BIT_7 (1 << 7)
#define MXC_F_BIT_8 (1 << 8)
#define MXC_F_BIT_9 (1 << 9)
#define MXC_F_BIT_10 (1 << 10)
#define MXC_F_BIT_11 (1 << 11)
#define MXC_F_BIT_12 (1 << 12)
#define MXC_F_BIT_13 (1 << 13)
#define MXC_F_BIT_14 (1 << 14)
#define MXC_F_BIT_15 (1 << 15)
#define MXC_F_BIT_16 (1 << 16)
#define MXC_F_BIT_17 (1 << 17)
#define MXC_F_BIT_18 (1 << 18)
#define MXC_F_BIT_19 (1 << 19)
#define MXC_F_BIT_20 (1 << 20)
#define MXC_F_BIT_21 (1 << 21)
#define MXC_F_BIT_22 (1 << 22)
#define MXC_F_BIT_23 (1 << 23)
#define MXC_F_BIT_24 (1 << 24)
#define MXC_F_BIT_25 (1 << 25)
#define MXC_F_BIT_26 (1 << 26)
#define MXC_F_BIT_27 (1 << 27)
#define MXC_F_BIT_28 (1 << 28)
#define MXC_F_BIT_29 (1 << 29)
#define MXC_F_BIT_30 (1 << 30)
#define MXC_F_BIT_31 (1 << 31)

/******************************************************************************/
/*                                                               Bit Banding  */
#define BITBAND(reg, bit)                                                               \
    ((0xf0000000 & (uint32_t)(reg)) + 0x2000000 + (((uint32_t)(reg)&0x0fffffff) << 5) + \
     ((bit) << 2))

#define MXC_CLRBIT(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit) = 0)
#define MXC_SETBIT(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit) = 1)
#define MXC_GETBIT(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit))

#define MXC_SETFIELD(reg, mask, setting) (reg = ((reg) & ~(mask)) | ((setting) & (mask)))

/******************************************************************************/
/*                                                                  SCB CPACR */

/* Note: Added by Maxim Integrated, as these are missing from CMSIS/Core/Include/core_cm4.h */
#define SCB_CPACR_CP10_Pos 20 /*!< SCB CPACR: Coprocessor 10 Position */
#define SCB_CPACR_CP10_Msk (0x3UL << SCB_CPACR_CP10_Pos) /*!< SCB CPACR: Coprocessor 10 Mask */
#define SCB_CPACR_CP11_Pos 22 /*!< SCB CPACR: Coprocessor 11 Position */
#define SCB_CPACR_CP11_Msk (0x3UL << SCB_CPACR_CP11_Pos) /*!< SCB CPACR: Coprocessor 11 Mask */

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32665_INCLUDE_MAX32665_H_
